-- Δημιουργία βάσης (SQLite δεν υποστηρίζει CREATE DATABASE, απλά ανοίγεις αρχείο)
-- Στη συνέχεια δημιουργείς τους πίνακες:

CREATE TABLE budget (
    id INTEGER PRIMARY KEY,
    foreas TEXT NOT NULL,
    poso INTEGER NOT NULL CHECK (poso > 0),
    pososto REAL GENERATED ALWAYS AS (poso / 25000000.0)
);



INSERT INTO budget (id, foreas, poso) VALUES
    (1001, 'ΠΡΟΕΔΡΙΑ ΤΗΣ ΔΗΜΟΚΡΑΤΙΑΣ', 4638000 ),
    (1003, 'ΒΟΥΛΗ ΤΩΝ ΕΛΛΗΝΩΝ', 171950000 ),
    (1004, 'ΠΡΟΕΔΡΙΑ ΤΗΣ ΚΥΒΕΡΝΗΣΗΣ', 41689000 ),
    (1007, 'ΥΠΟΥΡΓΕΙΟ ΕΣΩΤΕΡΙΚΩΝ', 3830276000 ),
    (1009, 'ΥΠΟΥΡΓΕΙΟ ΕΞΩΤΕΡΙΚΩΝ', 420237000 ),
    (1011, 'ΥΠΟΥΡΓΕΙΟ ΕΘΝΙΚΗΣ ΑΜΥΝΑΣ', 6130000000 ),
    (1017, 'ΥΠΟΥΡΓΕΙΟ ΔΙΚΑΙΟΣΥΝΗΣ', 650803000 ),
    (1020, 'ΥΠΟΥΡΓΕΙΟ ΠΑΙΔΕΙΑΣ ΘΡΗΣΚΕΥΜΑΤΩΝ ΚΑΙ ΑΘΛΗΤΙΣΜΟΥ', 6606000000 ),
    (1022, 'ΥΠΟΥΡΓΕΙΟ ΠΟΛΙΤΙΣΜΟΥ', 575419000 ),
    (1024, 'ΥΠΟΥΡΓΕΙΟ ΕΘΝΙΚΗΣ ΟΙΚΟΝΟΜΙΑΣ ΚΑΙ ΟΙΚΟΝΟΜΙΚΩΝ', 1246518464000 ),
    (1029, 'ΥΠΟΥΡΓΕΙΟ ΑΓΡΟΤΙΚΗΣ ΑΝΑΠΤΥΞΗΣ ΚΑΙ ΤΡΟΦΙΜΩΝ', 1281403000 ),
    (1032, 'ΥΠΟΥΡΓΕΙΟ ΕΡΓΑΣΙΑΣ ΚΑΙ ΚΟΙΝΩΝΙΚΗΣ ΑΣΦΑΛΙΣΗΣ', 18678084000 ),
    (1034, 'ΥΠΟΥΡΓΕΙΟ ΚΟΙΝΩΝΙΚΗΣ ΣΥΝΟΧΗΣ ΚΑΙ ΟΙΚΟΓΕΝΕΙΑΣ', 3989553000 ),
    (1036, 'ΥΠΟΥΡΓΕΙΟ ΑΝΑΠΤΥΞΗΣ', 818045000 ),
    (1039, 'ΥΠΟΥΡΓΕΙΟ ΥΠΟΔΟΜΩΝ ΚΑΙ ΜΕΤΑΦΟΡΩΝ', 2694810000 ),
    (1041, 'ΥΠΟΥΡΓΕΙΟ ΝΑΥΤΙΛΙΑΣ ΚΑΙ ΝΗΣΙΩΤΙΚΗΣ ΠΟΛΙΤΙΚΗΣ', 651864000 ),
    (1045, 'ΥΠΟΥΡΓΕΙΟ ΤΟΥΡΙΣΜΟΥ', 189293000 ),
    (1053, 'ΥΠΟΥΡΓΕΙΟ ΨΗΦΙΑΚΗΣ ΔΙΑΚΥΒΕΡΝΗΣΗΣ', 1073928000 ),
    (1055, 'ΥΠΟΥΡΓΕΙΟ ΜΕΤΑΝΑΣΤΕΥΣΗΣ ΚΑΙ ΑΣΥΛΟΥ', 475871000 ),
    (1057, 'ΥΠΟΥΡΓΕΙΟ ΠΡΟΣΤΑΣΙΑΣ ΤΟΥ ΠΟΛΙΤΗ', 2285820000 ),
    (1060, 'ΥΠΟΥΡΓΕΙΟ ΚΛΙΜΑΤΙΚΗΣ ΚΡΙΣΗΣ ΚΑΙ ΠΟΛΙΤΙΚΗΣ ΠΡΟΣΤΑΣΙΑΣ', 1221116000 );

SELECT * FROM budget;

