CREATE DATABASE green_budget_2025;

USE green_budget_2025;

CREATE TABLE budget (
    id INT PRIMARY KEY AUTO_INCREMENT,
    foreas VARCHAR(70) NOT NULL,
    poso INT NOT NULL CHECK (poso>0),
    website VARCHAR (200),
    pososto DECIMAL (6,2)
            AS (poso/25000000)
);
CREATE TABLE Users (
    user_id INT PRIMARY KEY,
    full_name NVARCHAR(150) NOT NULL,
    mail NVARCHAR(150) UNIQUE NOT NULL,
    role NVARCHAR(50) NOT NULL,  -- admin, analyst, ministry_use
);
CREATE TABLE Programs (
       program_id INT PRIMARY KEY,
       budgetid INT NOT NULL,
       program NVARCHAR(255) NOT NULL,
       verifiedamount DECIMAL(18,2) NOT NULL
);
INSERT INTO budget (id, foreas, poso, website) VALUES
    (1001, "ΠΡΟΕΔΡΙΑ ΤΗΣ ΔΗΜΟΚΡΑΤΙΑΣ", 4638000),
    (1003, "ΒΟΥΛΗ ΤΩΝ ΕΛΛΗΝΩΝ", 171950000),
    (1004, "ΠΡΟΕΔΡΙΑ ΤΗΣ ΚΥΒΕΡΝΗΣΗΣ", 41,689,000),
    (1007, "ΥΠΟΥΡΓΕΙΟ ΕΣΩΤΕΡΙΚΩΝ", 3,830,276,000),
    (1009 ,"ΥΠΟΥΡΓΕΙΟ ΕΞΩΤΕΡΙΚΩΝ" , 420,237,000),
    (1011 , "ΥΠΟΥΡΓΕΙΟ ΕΘΝΙΚΗΣ ΑΜΥΝΑΣ" , 6,130,000,000),
    (1017 , "ΥΠΟΥΡΓΕΙΟ ΔΙΚΑΙΟΣΥΝΗΣ" , 650,803,000 ),
    ( 1020 , "ΥΠΟΥΡΓΕΙΟ ΠΑΙΔΕΙΑΣ ΘΡΗΣΚΕΥΜΑΤΩΝ ΚΑΙ ΑΘΛΗΤΙΣΜΟΥ" , 6,606,000,000 ),
    ( 1022 , "ΥΠΟΥΡΓΕΙΟ ΠΟΛΙΤΙΣΜΟΥ" , 575,419,000),
    ( 1024 , "ΥΠΟΥΡΓΕΙΟ ΕΘΝΙΚΗΣ ΟΙΚΟΝΟΜΙΑΣ ΚΑΙ ΟΙΚΟΝΟΜΙΚΩΝ" , 1,246,518,464,000),
    ( 1029 , "ΥΠΟΥΡΓΕΙΟ ΑΓΡΟΤΙΚΗΣ ΑΝΑΠΤΥΞΗΣ ΚΑΙ ΤΡΟΦΙΜΩΝ" , 1,281,403,000),
    ( 1032 , "ΥΠΟΥΡΓΕΙΟ ΕΡΓΑΣΙΑΣ ΚΑΙ ΚΟΙΝΩΝΙΚΗΣ ΑΣΦΑΛΙΣΗΣ" , 18,678,084,000),
    ( 1034 , "ΥΠΟΥΡΓΕΙΟ ΚΟΙΝΩΝΙΚΗΣ ΣΥΝΟΧΗΣ ΚΑΙ ΟΙΚΟΓΕΝΕΙΑΣ" ,  3,989,553,000),
    (1036 , "ΥΠΟΥΡΓΕΙΟ ΑΝΑΠΤΥΞΗΣ" ,  818,045,000),
    ( 1039 , "ΥΠΟΥΡΓΕΙΟ ΥΠΟΔΟΜΩΝ ΚΑΙ ΜΕΤΑΦΟΡΩΝ" , 2,694,810,000 ),
    ( 1041 , "ΥΠΟΥΡΓΕΙΟ ΝΑΥΤΙΛΙΑΣ ΚΑΙ ΝΗΣΙΩΤΙΚΗΣ ΠΟΛΙΤΙΚΗΣ" ,  651,864,000 ),
    (1045, "ΥΠΟΥΡΓΕΙΟ ΤΟΥΡΙΣΜΟΥ" , 189,293,000),
    (1053 , "ΥΠΟΥΡΓΕΙΟ ΨΗΦΙΑΚΗΣ ΔΙΑΚΥΒΕΡΝΗΣΗΣ" , 1,073,928,000 ),
    (1055,  "ΥΠΟΥΡΓΕΙΟ ΜΕΤΑΝΑΣΤΕΥΣΗΣ ΚΑΙ ΑΣΥΛΟΥ" , 475,871,000),
    (1057, "ΥΠΟΥΡΓΕΙΟ ΠΡΟΣΤΑΣΙΑΣ ΤΟΥ ΠΟΛΙΤΗ" , 2,285,820,000),
    (1060, "ΥΠΟΥΡΓΕΙΟ ΚΛΙΜΑΤΙΚΗΣ ΚΡΙΣΗΣ ΚΑΙ ΠΟΛΙΤΙΚΗΣ ΠΡΟΣΤΑΣΙΑΣ" , 1,221,116,000);

SELECT * FROM budget;
